import pandas as pd

df = pd.read_csv("PANDAS/data/13_diecasting_shot.csv")
df.info()


df_sorted = df.sort_values("비스킷두께") # 오름 차순 !
print(df_sorted.head())
#  샷  실린더압력    주조압력  사이클타임  비스킷두께    형체력 품질등급
# 185  186  218.0  1054.0   21.4    2.0  253.0   불량
# 184  185  219.0  1058.0   21.3    2.0  255.0   불량
# 182  183  215.0  1041.0   21.3    4.0  258.0   불량
# 89    90  235.0  1137.0   22.5    7.0  255.0   주의
# 0      1  214.0  1037.0   20.7   10.0  258.0   양품

df_ascending_false = df.sort_values("비스킷두께", ascending=False) # ascending=False --> 내림 차순 !
print(df_ascending_false.head())
# 샷  실린더압력    주조압력  사이클타임  비스킷두께    형체력 품질등급
# 197  198  113.0   255.0   36.6   27.0  354.0   불량
# 191  192  113.0   255.0   36.9   26.0  366.0   불량
# 42    43  215.0  1040.0   20.7   21.0  253.0   주의
# 196  197  265.0   595.0   36.2   20.0  355.0   불량
# 170  171  265.0   596.0   36.1   20.0  370.0   주의

print("-"*60)
# print((df_sorted.head(5)).tolist())

df_mult = df.sort_values(['품질등급', '형체력'])
print(df_mult.head())

# 샷  실린더압력    주조압력   사이클타임  비스킷두께    형체력 품질등급
# 180  181  108.0   522.0   652.3   14.0  222.0   불량
# 199  200  108.0   525.0  6170.0   15.0  237.0   불량
# 181  182  214.0  1036.0    93.1   12.0  247.0   불량
# 186  187  108.0   524.0    22.9   14.0  247.0   불량
# 185  186  218.0  1054.0    21.4    2.0  253.0   불량

# 여러 열을 우선순위 다중 정렬
# 품질등급을 우선 오름차순으로 정렬하고
# 형체력을 그 다음 순서로 내림차순 정렬하기
df_mult_2 = df.sort_values(['품질등급', '형체력'], ascending= [True, False])
print(df_mult_2.head())

# 샷  실린더압력   주조압력  사이클타임  비스킷두께    형체력 품질등급
# 195  196  264.0  594.0   76.3   19.0  381.0   불량
# 198  199  264.0  595.0   36.1   19.0  372.0   불량
# 193  194  113.0  255.0   34.4   19.0  370.0   불량
# 191  192  113.0  255.0   36.9   26.0  366.0   불량
# 192  193  264.0  594.0   36.9   19.0  355.0   불량


df_filtered = df[df['품질등급'] == '불량']
print(df_filtered.head())

df_fin = df[df['품질등급'] == '불량'].sort_values('비스킷두께', ascending= [False])

print(df_fin.head())



