#  + : 더하기
#  - : 빼기
#  * : 곱하기
#  / : 나누기

print(7 + 14)
print(7 - 14) # 계산 결과가 음수여도 출력 가능
print(7 * 14)
print(7 / 14)

print(75 + 80 / 2)
print((75 + 80) / 2)

# ---------------------------------------------------
# 실습 하나 해볼게요

print("두 측정값의 합:", 100 + 55)
print("온도 변화량:", 7)
print("평균 온도:", 77.5)

print("두 측정값의 합:", 100 + 55)
print("온도 변화량:", 10 - 3)
print("평균 온도:", 155 / 2)

# ---------------------------------------------------
# 실습 하나 해볼게요
print("두 측정값의 합:", 7 + 77.5)
print("온도 변화량:", 77.5 - 7)
print("평균 온도:", (75 + 77.5) / 2)


# ---------------------------------------------------
# 실습 연습

# 아래의 두 코드는 출력된 모습이 동일하게 작성되었습니다.

print("평균","온도를","오른쪽에서","볼","수","있어요",":",(55 + 35)/2)
# 쉼표는 띄어쓰기로 치환됩니다. 괄호로 사칙 연산의 순서를 지정해요.

print("평균 " + "온도를 " + "오른쪽에서 " + "볼 " + "수 " + "있어요 " + ":" , (55 + 35)/2)
# 문자열 안에 띄어쓰기를 넣어서 +로 문장을 구성했어요. 문자열과 숫자는 +를 사용할 수 없어요.

